Repository: jiya-talreja/multi_language_detection
Catalog: backend/input/opus/en-hi.tmx
Source language: en
Languages: hi

source: All human beings are born free and equal in dignity and rights. They are endowed with reason and conscience and should act towards one another in a spirit of brotherhood.
hi: सभी मनुष्यों को गौरव और अधिकारों के मामले में जन्मजात स्वतन्त्रता प्राप्त है। उन्हें बुद्धि और अन्तरात्मा की देन प्राप्त है और परस्पर उन्हें भाईचारे के भाव से बर्ताव करना चाहिये।

source: It's the third biggest city of Serbia.
hi: यह सर्बिया का तीसरा सबसे बड़ा शहर है.

source: Hello, Chicago!
hi: नमस्ते, शिकागो!

source: Come in.
hi: अंदर आ जाओ।

source: Come on in.
hi: अंदर आ जाओ।

source: I don't know.
hi: मुझे नहीं पता।

source: How many times a day does that bus run?
hi: वह बस दिन में कितनी बार चलती है?

source: Foreign people are amusing.
hi: विदेशी लोग बड़े मनोरंजक होते हैं।

source: When in Rome, do as the Romans do.
hi: जैसा देस, वैसा भेस।

source: Good medicine is bitter.
hi: अच्छी दवाई कड़वी होती है।

source: I forgot to ask him.
hi: मैं उससे पूछना भूल गया।

source: These students are the crème de la crème of our school.
hi: ये हमारे विद्यालय के सबसे उत्कृष्ट विद्यार्थी हैं।

source: Enough for one day.
hi: एक दिन के लिए इतना काफ़ी है।

source: It's very romantic!
hi: बहुत रोमैंटिक है!

source: Happy New Year!
hi: नव वर्ष की शुभकामनाएं!

source: Achoo!
hi: आकछू!

source: Die!
hi: मरो!

source: The world will smile happily without me.
hi: दुनिया मेरे बिना खुशी से मुस्कुराएगी।

source: Life is a long, long road.
hi: ज़िन्दगी एक बहुत लम्बा सफ़र है।

source: The world is a small village.
hi: दुनिया एक छोटा सा गाँव है।

source: We are Arabs.
hi: हम अरब हैं।

source: You are my friend.
hi: तुम मेरा दोस्त हो।

source: I have a problem.
hi: मैं मुश्किल में हूँ।

source: This book is Ali's.
hi: यह किताब अली की है।

source: Where do you live?
hi: आप कहाँ रहते हैं?

source: I am not from India.
hi: मैं भारत से नहीं हूँ।

source: It looks like you are from India.
hi: लगता है कि तुम भारत के हो।

source: These are birds.
hi: ये चिड़ियाँ हैं।

source: The women of France are beautiful.
hi: फ़्रांस की औरतें खूबसूरत हैं।

source: She can play the piano.
hi: वह पियानो बजाना जानती है।

source: "What time is it?" "It's 3:20."
hi: "अभी कितने बजे हैं?" "तीन बीस बजे हैं"

source: We have eaten there three times.
hi: हम वहाँ तीन बार खा चुके हैं।

source: Magnesium is a chemical element.
hi: मैग्नीशियम एक रासायनिक पदार्थ है.

source: Only a few people didn't go there.
hi: बहुत कम लोग थे जो वहाँ नहीं गए।

source: You want to drink tea or coffee?
hi: तुम चाय पीना चाहते हो या कॉफ़ी?

source: Really?
hi: सच?

source: How are you?
hi: आप कैसे हैं?

source: Hello!
hi: नमस्ते।

source: The work must be completed by tomorrow.
hi: काम कल तक खतम होना होगा।

source: Perfect!
hi: उत्तम!

source: Thank you!
hi: धन्यवाद!

source: My name is Wang.
hi: मेरा नाम वांग है।

source: I understand it a little, but I can't speak it.
hi: मैं थोड़ा-बहुत समझ सकता हूँ, पर बोल नहीं सकता हूँ।

source: You must not be afraid of making mistakes when learning a language.
hi: कोई भी नई भाषा सीखने में ग़लतियों से डरना नहीं चहिए।

source: What were you doing?
hi: तुम क्या कर रहे थे?

source: Are you ready?
hi: क्या आप तैयार हैं?

source: I do not understand.
hi: मैं समझा नहीं।

source: Do you speak English?
hi: क्या आप अंग्रेज़ी बोलते हैं?

source: Clean the room.
hi: कमरे को साफ़ करो।

source: He is in hospital.
hi: वह अस्पताल में है।

source: I have a dog.
hi: मेरे पास एक कुत्ता है।

source: Today, I saw a star.
hi: मैंने आज एक तारा देखा।

source: My name is Andrea.
hi: मेरा नाम एंड्रिया है।

source: I'm an atheist.
hi: मैं अनीश्वरवादी हूँ।

source: He needs money.
hi: उसे पैसों की ज़रूरत है।

source: We don't know him.
hi: हम उसे नहीं जानते हैं।

source: I want a cup of tea.
hi: मुझे एक कप चाय चाहिए।

source: Can you teach me how to steal?
hi: क्या तुम मुझे चोरी करना सिखा सकते हो?

source: Can you teach me how to fly?
hi: क्या तुम मुझे उड़ना सिखा सकते हो?

source: I know that all of this is just a game.
hi: मैं जानता हूँ कि यह सब एक खेल है।

source: Did it not occur to you to close the windows?
hi: तुम्हें खिड़कियाँ बंद करने की नहीं सूझी?

source: No, I'm not afraid of ghosts.
hi: नहीं, मैं भूतों से नहीं डरता।

source: It's raining cats and dogs.
hi: मुसलाधार बारिश होती है।

source: If possible, I'd like to travel around the world.
hi: अगर हो सके तो मैं विष्व यात्रा पर जाना चाहूँगा।

source: Excuse me, what time is it?
hi: माफ़ कीजिए, क्या समय हुआ है?

source: When you have things you don't understand written on you, what will you do, if you get unexpected results?
hi: अगर तुम अपने आप पर ऐसी चीज़ें लिखवाते हो जो तुम खुद भी नहीं समझ सकते, तो तुम क्या करोगे अगर तुम्हें अनपेक्षित परिणाम मिलेंगे?

source: I was searching for something that didn't exist.
hi: मैं एक ऐसी चीज़ ढूँढ रहा था जिसका अस्तित्व कभी था ही नहीं।

source: Will the weather be good tomorrow?
hi: कल मौसम अच्छा होगा क्या?

source: He likes oranges.
hi: उसे संत्रे अच्छे लगते हैं।

source: I don't like school.
hi: मुझे पाठशाला पसंद नहीं है।

source: It's hard to say what the weather will be like tomorrow.
hi: कल का मौसम कैसा होगा कहना मुश्किल है।

source: We have three airplanes.
hi: हमारे पास तीन हवाई जहाज़ हैं।

source: Let's start the party.
hi: पार्टी शुरू करते हैं।

source: The house is burning.
hi: घर जल रहा है।

source: That program is now being broadcast.
hi: वह कार्यकर्म अभी प्रस्तुत किया जा रहा है.

source: Christmas is coming.
hi: क्रिसमस आ रहा है।

source: This is a good newspaper, isn't it?
hi: यह एक अच्छा अखबार है ना?

source: I hear that she's a famous actress.
hi: मैंने सुना है कि वे मश्हूर अभिनेत्री हैं।

source: She hated her husband.
hi: वह अपने पति से नफ़रत करती थी।

source: She kept on working.
hi: वह काम करती रही।

source: I'll never forget how kind you have been.
hi: मैं आपके अच्छेपन को कभी नहीं भूलूँगा।

source: The fat woman was holding a monkey.
hi: उस मोटी औरत ने एक बंदर पकड़ा हुआ था।

source: She can speak English, of course.
hi: बेशक वह अंग्रेजी बोल सकती है.

source: Green suits Alice.
hi: ऐलिस पर हरा रंग जचता है।

source: What do you think she is doing now?
hi: तुम्हारे हिसाब से वह अभी क्या कर रही होगी?

source: She was crying in her room.
hi: वह अपने कमरे में रो रही थी।

source: She was watching the dead leaves fall.
hi: वह मुर्झाई हुई पत्तियों को गिरते हुए देख रही थी।

source: What is your age?
hi: तुम्हारी उम्र क्या है?

source: In May, all birds lay an egg.
hi: मई में चिड़ियाँ अंडे देतीं हैं।

source: Please wait here until he comes.
hi: उसके आने तक यहाँ इंतेज़ार कीजिए।

source: Is this what you wanted?
hi: तुम यही चाहते थे ना?

source: He'll get well soon.
hi: वह जल्द ही ठीक हो जाएगा।

source: What is this?
hi: यह क्या है?

source: Finally!
hi: आखिरकार!

source: Please.
hi: कृपया।

source: I don't want your pity.
hi: मुझे तुम्हारी दया नहीं चहिए।

source: Summer is over.
hi: गर्मियाँ खतम हों चुकीं हैं।

source: Does milk spoil quickly?
hi: दूध जल्दी से खराब हो जाता है क्या?

source: I felt that I should help her.
hi: मुझे लगा कि मुझे उसकी मदद करनी चाहिए।

source: I tried to erase the memory of her crying.
hi: मैंने उसके रोने की याद को भुला देने की कोशिश करी।

source: Two plus two makes four.
hi: दो और दो चार होते हैं।

source: What's the matter?
hi: मुश्किल क्या है?

source: Do you have one that's cheaper?
hi: इससे सस्ता वाला है क्या?

source: I know those women.
hi: मैं उन औरतों को जानता हूँ।

source: I like that singer a lot.
hi: मुझे वह गायक बहुत पसंद है।

source: That guy annoys me.
hi: मुझे उस आदमी से चिढ़ आती है।

source: Why didn't you go to the office?
hi: तुम दफ़्तर क्यों नहीं गए?

source: I wrote down his name so I wouldn't forget it.
hi: मैंने उसका नाम लिख लिया जिससे कि मैं उसे भूल न जाऊँ।

source: We hurried to the train station.
hi: हम जल्दबाज़ी में ट्रेन स्टेशन गए।

source: Great!
hi: बढ़िया!

source: His success is the result of many years of perseverance.
hi: उसकी सफ़लता सालों की मेहनत का फल है।

source: Where did all the bread go?
hi: सारा ब्रॅड कहाँ चला गया?

source: It started to snow.
hi: बरफ़ गिरनी शुरू गो गई।

source: These are our books.
hi: ये हमारी किताबें हैं।

source: Those books aren't yours?
hi: वे तुम्हारी किताबें नहीं हैं?

source: I am tired.
hi: मैं थक गया हूँ।

source: That man has many debts.
hi: इस आदमी के पास बहुत सारे कर्ज़ हैं।

source: I wish you spoke Spanish.
hi: काश तुम स्पैनिश बोल सकते।

source: I had to decline his offer.
hi: मुझे उसके प्रस्ताव को अस्वीकार करना पड़ा।

source: Spiders like to build spiderwebs.
hi: मकड़ियों को जाल बुनना अच्छा लगता है।

source: Hello, world!
hi: नमस्ते दुनिया।

source: I always walk.
hi: मैं हमेशा चलता हूँ।

source: She likes Russian pop.
hi: उसे रूसी पॉप संगीत पसंद है।

source: Do you accept credit cards?
hi: क्या आप क्रेडिट कार्ड स्वीकार करते हैं?

source: If my boy had not been killed in the traffic accident, he would be a college student now.
hi: अगर मेरा बेटा ट्रेफ़िक हादसे में नहीं मारा गया होता, तो वह अभी कॉलेज जा रहा होता।

source: When he arrives in Tokyo, I'll call you right away.
hi: उसके टोक्यो आते ही मैं तुम्हें तुरंत फ़ोन करूँगी।

source: He couldn't sleep because of the noise outside his window.
hi: उसकी खिड़की के बाहर इतना शोर हो रहा था कि वह सो नहीं पा रहा था।

source: I don't want to buy this kind of sofa.
hi: मुझे इस तरह का सोफ़ा नहीं खरीदना है।

source: First we'll eat, and then we'll go.
hi: पहले खाएंगे, फिर जाएंगे।

source: Speaking English isn't easy.
hi: अंग्रेज़ी बोलना आसान नहीं है।

source: He became a policeman.
hi: वह पुलिस अफ़सर बन गया।

source: The police officer arrested the burglar.
hi: पुलिस अफ़सर ने चोर को हिरासत में लेलिया।

source: You have to wait in line.
hi: आपको लाईन में लगकर इंतेज़ार करना पड़ेगा।

source: I remember that man's name very well.
hi: मुझे उस आदमी का नाम अच्छी तरह से याद है।

source: Not only did I eat pilaf, but I also ate kebabs.
hi: मैंने पुलाव ही नहीं, बल्कि कबाब भी खाए।

source: She teaches us French.
hi: वह हमें फ़्रांसीसी सिखाती है।

source: You can't prove that.
hi: तुम वह साबित नहीं कर सकते।

source: Where's the airport?
hi: हवाई अड्डा कहाँ पर है?

source: I can't put up with his arrogance.
hi: मुझसे उसका अक्खड़पन झेला नहीं जाता।

source: I'm hungry!
hi: मुझे भूख लगी है!

source: She asked me for help.
hi: उसने मुझसे मदद मांगी।

source: What is happiness?
hi: खुशी क्या होती है?

source: Are you at home?
hi: तुम घर पे हो क्या?

source: You shouldn't wait here.
hi: तुम्हें यहाँ इंतेज़ार नहीं करना चाहिए।

source: The rumor turned out to be true.
hi: वह अफ़वाह सच निकली।

source: The conference will end tomorrow.
hi: सम्मेलन कल समाप्त होगा।

source: We're eating apples.
hi: हम सेब खा रहे हैं।

source: Tom is my friend.
hi: टॉम मेरा दोस्त है।

source: Were you able to open up and talk?
hi: तुम खुलकर बात कर सके क्या?

source: I'm not sure how much we should wait.
hi: मुझे नहीं पता हमे कितनी देर इंतेज़ार करना चाहिए।

source: This was Rodica's fifth book.
hi: यह रोडिका की पाँचवी किताब थी।

source: What's your name?
hi: आपका नाम क्या है?

source: Maybe it will snow.
hi: शायेद हिमपात होगा.

source: I am hungry.
hi: मुझे भूख लगी है।

source: Even Japanese people make mistakes using the prefixes 'o' and 'go'.
hi: "ओ" और "गो" इन उपसर्गों के उपयोग में जापानी लोग भी गलतीयाँ करते हैं।

source: Do you want to know my secret? It's very simple...
hi: तुम मेरा राज़ जानना चाहते हो? बहुत ही आसान है...

source: She likes oranges.
hi: उसे सन्तरा पसंद है।

source: I continued singing.
hi: मैं गाता चला गया।

source: It is better to live rich, than to die rich.
hi: अमीर हो कर मरने से बेहतर है अमीर हो कर जीना।

source: In case I can't come, I'll give you a call beforehand.
hi: अगर मैं नहीं आ पाया तो तुम्हें पहले फ़ोन करके बतादूँगा।

source: I'll pay.
hi: मैं पैसे दूंगा।

source: Please tell me what I should do.
hi: कृपया बताएं अब मुझे क्या करना चाहिए.

source: Patriots always talk of dying for their country, and never of killing for their country.
hi: देशप्रेमी हमेशा अपने देश के लिए मरने की बात करते हैं, कभी देश के लिए मारने की नही।

source: I know the history of Europe very well.
hi: मैं युरोप का इतिहास बड़ी अच्छी तरह से जानता हूँ।

source: I cannot understand what happened.
hi: मुझे समझ में नहीं आ रहा क्या हुआ।

source: Do whatever you want, there will be gossiping anyhow.
hi: जो करना है करो, पर इस बात की चर्चा तो हो गी ही।

source: I always rely on him in times of trouble.
hi: मैं मुसीबत के समय में हमेशा उसपर भरोसा करती हूँ।

source: Turn left and you will find the cafe.
hi: बाएं मुड़ो और तुम्हें एक कैफ़े मिलेगा।

source: An old man was resting in the shade of the tree.
hi: एक बूढ़ा आदमी पेड़ की छाया में आराम कर रहा था।

source: One, two, three, four, five, six, seven, eight, nine, ten.
hi: एक, दो, तीन, चार, पाँच, छः, सात, आठ, नौ, दस।

source: He's famous around the world.
hi: वह दुनिया भर में प्रसिद्ध है।

source: This is my mother.
hi: यह मेरी माँ है।

source: What's this?
hi: यह क्या है?

source: What time does your watch say it is now?
hi: तुम्हारी घड़ी अब क्या समय बता रही है?

source: I live near here.
hi: मैं आस-पड़ोस में रहता हूँ।

source: The ice melted.
hi: बर्फ़ पिघला.

source: I will try.
hi: मैं कोशिश करूँगा।

source: Please sit down.
hi: बैठिए।

source: He called me a taxi.
hi: उसने मेरे लिए टेक्सी बुलवाई।

source: He works at a bank.
hi: वह बैंक में काम करता है।

source: Where are you going?
hi: तुम कहाँ जा रहे हो?

source: Liar today, thief tomorrow.
hi: आज झूठा, कल चोर।

source: You're a human.
hi: तुम इनसान हो।

source: What is the problem?
hi: समस्या क्या है?

source: These shoes are hers.
hi: यह जूते उसके हैं।

source: Happy Fourth of July!
hi: ४ जुलाई मुबारक हो!

source: There's been a lot of rain this year.
hi: इस साल बहुत बारिश पड़ी है।

source: We only have tea.
hi: हमारे पास तो बस चाय है।

source: How many kebabs will you have?
hi: कितने कबाब लोगे?

source: When do you usually get off work?
hi: तुम आमतौर पर कितने बजे काम से छूटते हो?

source: We have five kinds of kebab.
hi: हमारे पास पाँच तरह के कबाब हैं।

source: Chris gets 7 gold coins!
hi: क्रिस को सात सोने के सिक्के मिलते हैं!

source: We have pilaf, lo mein, and kebabs in our restaurant.
hi: हमारे रेस्तराँ में पुलाव, लो मेइन और कबाब हैं।

source: "My mother's American, and my father is Uighur." "Really?" "No! I was joking!"
hi: "मेरी माँ अमरीकी है और पिता उइघुर।" "सच?" "नहीं! मैं बस मज़ाक कर रहा था।"

source: I'm not an Uighur. I'm a Russian.
hi: मैं उइघुर नहीं हूँ। मैं रूसी हूँ।

source: Mary helped her mother cook.
hi: मैरी ने खाना पकाने में अपने मां की मदत की।

source: Let's meet this afternoon.
hi: इस दोपहर को मिलते हैं।

source: He's always dissatisfied.
hi: वह कभी भी संतुष्ट नहीं होता।

source: How do people manage to sleep on the plane?
hi: लोग हवाईजहाज़ में सो कैसे पाते हैं?

source: Muiriel is an Indian.
hi: म्यूरियल भारतीय है।

source: It will snow tomorrow.
hi: कल बरफ़ पड़ेगी।

source: Hold it, are you kidding me? Why'd we wanna go to such a remote location?
hi: रुको, क्या तुम मेरे साथ ठठा कर रहे हो? भला हम इतनी दूर जगह क्यूँ जाने लगे?

source: I'll never come back.
hi: मैं कभी वापस नहीं आऊँगा।

source: The enemy won't get close.
hi: दुश्मन पास नहीं आ पाएगा।

source: I've heard that Robert is ill.
hi: मैंने सुना है कि रॉबर्ट बीमार है।

source: The food's not ready yet.
hi: खाना अभी तक तैयार नहीं हुआ है।

source: Pay attention!
hi: ध्यान दो!

source: I want to leave this difficult job to her.
hi: मैं यह मुश्किल काम उसके लिए छोड़ना चाहता हूँ।

source: He left his parents when he was eight years old.
hi: वह आठ साल का था जब उसने अपने माता-पिता को छोड़ दिया।

source: Let's order twenty kebabs!
hi: बारह कबाब मंगाते हैं!

source: I need to go home a little early today.
hi: मुझे आज थोड़ा जल्दी घर जाना है।

source: What time is it?
hi: अभी कितने बजे हैं?

source: Perhaps he will never be famous.
hi: संभवतः वह विख्यात कभी नहीँ हो पाएगा।

source: You didn't have to come so early.
hi: तुम्हे इतना जल्दी आने की ज़रूरत नहीं थी।

source: The pilaf with meat is eight yuan. The vegetarian pilaf is only four yuan.
hi: मांस वाला पुलाव आठ युएन का है। बिना मांस वाला पुलाव केवल चार युएन का है।

source: We're going home.
hi: हम घर जा रहें हैं।

source: Every apple is red.
hi: हर एक सेब लाल है।

source: Apples are red.
hi: सेब लाल होते हैं।

source: You came alone today?
hi: तुम आज अकेले आए हो?

source: Nancy had never seen a giant panda.
hi: नॅन्सी ने कभी भी विशालकाय पांडा नहीं देखा था।

source: When I look of this photo I remember my family.
hi: जब मैं इस तस्वीर को देखता हूं, मुझें मेरे परिवार की याद आती है।

source: The station is located between these two towns.
hi: स्टेशन इन दो नगरों के बीच स्थित है।

source: My name is Hashimoto.
hi: मेरा नाम हाशिमोतो है।

source: He's big and strong.
hi: वह बड़ा और ताकतवर है।

source: It is forbidden to read books in this bookshop.
hi: इस बुकशॉप में किताबें पढ़ना मना है।

source: Was his story true?
hi: उसकी कहानी सच्ची थी क्या?

source: Everyone likes her.
hi: उसे सब पसंद करते हैं।

source: My aunt brought me flowers.
hi: मेरी बुआ-जी मेरे लिए फूल लाईं।

source: He has three sons.
hi: उसके पास तीन बेटे हैं।

source: I want my money back.
hi: मुझे अपने पैसे वापस चाहिए।

source: Cut the potatoes.
hi: आलूओं को काटो।

source: But I don't know how to cook kebabs!
hi: पर मुझे कबाब पकाना नहीं आता!

source: I'm bored.
hi: मैं बोर हो रहा हूँ।

source: John played the guitar and his friends sang.
hi: जॉन ने गिटार बजाया और उसके दोस्तों ने गाना गाया।

source: I was a teacher.
hi: मैं एक अध्यापिका थी.

source: Those who are about to die salute you.
hi: जो मरने वाले हैं वे तुम्हें सलाम करते हैं।

source: She's a stubborn girl.
hi: वह एक ज़िद्दी लड़की है।

source: There's an apple in this boy's pocket.
hi: इस लड़के के जेब में एक सेव है।

source: I am a Roman citizen.
hi: मैं रोमन नागरिक हूँ।

source: I understand.
hi: मैं समझता हूँ।

source: Of course.
hi: बिल्कुल।

source: Don't move.
hi: हिलो मत।

source: Excuse me.
hi: माफ़ कीजिए।

source: Wonderful!
hi: अद्भुत

source: Fantastic!
hi: बहुत ख़ूब!

source: Awesome!
hi: बहुत बढ़िया!

source: Go away!
hi: चले जाओ!

source: You're a person.
hi: तुम इनसान हो।

source: Were you shot?
hi: क्या तुम्हें गोली लग गई थी?

source: Answer my questions.
hi: मेरे सवालों का जवाब दो।

source: Don't touch it.
hi: उसे छूना मत।

source: The skies are clear.
hi: आसमान साफ़ है।

source: Don't get fat.
hi: मोटे मत हो जाना।

source: Come along with us.
hi: हमारे साथ आओ।

source: Come with us.
hi: हमारे साथ आओ।

source: I'm really tired.
hi: मैं बहुत थक गया हूँ।

source: Once again.
hi: और एक बार।

source: I'm a good-for-nothing bum.
hi: मैं निकम्मा हूँ।

source: Follow him.
hi: उसका पीछा करो।

source: I'm OK.
hi: मैं ठीक हूँ।

source: Yes. That's right.
hi: हाँ। यह सही है।

source: I'm full.
hi: मेरा पेट भर गया है।

source: You're kidding!
hi: मज़ाक कर रहे हो!

source: I'm very busy.
hi: मैं बहुत व्यस्थ हूँ।

source: A thick mist covered the countryside.
hi: गाँव पर गहरा कोहरा छा गया।

source: Are you sick?
hi: क्या तुम बीमार हो?

source: What an asshole!
hi: क्या चूतिया है!

source: Barcelona is in Spain.
hi: बार्सेलोना स्पेन में है।

source: Bastard!
hi: हरामज़ादे!

source: Because he is dirty and wet.
hi: क्योंकि वह गंदा और गीला है।

source: Can I see your passport?
hi: मैं आपका पासपोर्ट देख सकता हूँ क्या?

source: Come with me.
hi: मेरे साथ आइए ।

source: Could you speak more slowly?
hi: थोड़ा धीरे बोल सकते हैं क्या?

source: Did you do your homework?
hi: तुमने अपना होमवर्क कर लिया क्या?

source: Did you sleep well?
hi: तुम अच्छे से सोये क्या?

source: Do you have brothers and sisters?
hi: तुम्हारे पास भाई-बहन हैं क्या?

source: Do you have children?
hi: क्या आपके बच्चे हैं?

source: Does anyone here speak English?
hi: यहाँ पर कोई अंग्रेज़ी बोलता है क्या?

source: Enough!
hi: बहुत हुआ!

source: Faggot.
hi: होमोसेक्सुअल.

source: Fancy to eat at my place?
hi: मेरे यहाँ खाना खाना चाहती हो?

source: Forgive me, but I have no change.
hi: माफ़ कीजिएगा पर मेरे पास छुट्टे नहीं हैं।

source: Fuck!
hi: लानत है!

source: Fucking whore.
hi: रंडी साली।

source: He buys medicine.
hi: वह दवाइयां खरीदता है।

source: He has a little money.
hi: उसके पास थोड़े-बहुत पैसे हैं।

source: He is one of Spain's most famous authors.
hi: वे स्पेन के सबसे मशहूर लेखकों में से एक हैं।

source: He reads Arabic.
hi: वह अरबी पढ़ सकता है।

source: He says he's innocent, but they put him in jail.
hi: वह कहता है वह निर्दोष है, मगर उन्होंने उसे जेल में डाल दिया।

source: He speaks Arabic.
hi: वह अरबी बोलता है।

source: Help!
hi: बचाओ!

source: I've quit drinking beer.
hi: मैंने बीयर पीना छोड़ दिया है।

source: Whose turn is it?
hi: किसकी बारी है?

source: It's too big.
hi: बहुत ज़्यादा बड़ा है।

source: I'll attend.
hi: मैं आऊंगा।

source: We really enjoyed ourselves.
hi: हमने बड़ी मौज करी।

source: I like math.
hi: मुझे गणित पसंद है।

source: That's a good question.
hi: यह एक बहुत अच्छा सवाल है।

source: It's an easy victory.
hi: यह जीत तो बहुत आसान थी।

source: Everyone dies.
hi: मौत तो सभी की होती है।

source: There are also fish that fly.
hi: उड़ने वाली मछलीयां भी होती हैं।

source: His opinions are worthless.
hi: उसकी राय बेकार है।

source: How far along am I?
hi: मैं कहाँ तक पहुँच गया हूँ?

source: How many bowls do we have?
hi: हमारे पास कितनी कटोरियाँ हैं?

source: How much must I pay?
hi: मुझे कितने पैसे देने होंगे?

source: How old are you?
hi: तुम कितने साल के हो?

source: I am tall.
hi: मैं लंबा हूँ।

source: I agree.
hi: मैं सहमत हूँ।

source: I am a doctor.
hi: मैं डॉक्टर हूँ।

source: I am from Egypt.
hi: मैं मिस्र से हूँ।

source: I am from Russia.
hi: मैं रूस से हूँ।

source: I forgot.
hi: मैं भूल गया।

source: I have a Facebook account.
hi: मेरे पास फ़ेसबुक खाता है।

source: I have a heart condition.
hi: मुझे दिल की बीमारी है।

source: I like the blue one. How much does it cost?
hi: मुझे नीला वाला पसंद है, कितने का है?

source: I like this one.
hi: मुझे यह वाला पसंद है।

source: I love her so much that I can't leave her.
hi: मैं उससे इतना प्यार करता हूँ कि मैं उसे छोड़ नहीं सकता।

source: I must have left it on the bus.
hi: मैंने उसे बस में छोड़ दिया होगा।

source: I need coughing medicine.
hi: मुझे खाँसी की दवाई चाहिए।

source: I need money.
hi: मुझे पैसा चाहिए।

source: I teach Spanish.
hi: मैं स्पेनी सिखाता हूँ।

source: I wake up at 7 o'clock.
hi: मैं सात बजे सोकर उठता हूँ।

source: I want to clean the house before my parents return.
hi: मैं अपने पापा-मम्मी के वापस आने से पहले घर साफ़ करना चाहता हूँ।

source: I want to get to know you better.
hi: मैं तुम्हे और अच्छी तरह से जानना चाहता हूं।

source: I was born on 23 March 1969 in Barcelona.
hi: मैं बारसिलोना में २३ मार्च १९६९ में पैदा हुई थी।

source: She's our neighbour.
hi: वह हमारी पड़ोसी है।

source: We are happy.
hi: हम खुश हैं।

source: I can't prevent myself from thinking.
hi: मैं अपने-आप को सोचने से रोक नहीं सकता।

source: Barcelona is the capital city of Catalonia and the second largest city in Spain.
hi: बार्सेलोना केटलोनिआ की राजधानी और स्पेन का दूसरा सबसे बड़ा शहर है।

source: We don't know her.
hi: हम उसे नहीं जानते हैं।

source: Do you live with your parents?
hi: क्या तुम अपने मम्मी-पापा के साथ रहते हो?

source: I am going to go play ball with Mohan.
hi: मैं मोहन के साथ गेंद खेलने जा रहा हूँ।

source: You didn't understand.
hi: तुम समझे नहीं।

source: The power's out.
hi: बिजली गई हुई है।

source: Please speak in a louder voice.
hi: थोड़ी ऊँची आवाज़ में बोलिए।

source: This flag is very beautiful.
hi: यह झंडा बहुत खूबसूरत है।

source: That isn't fair.
hi: यह तो ठीक नहीं है।

source: Mount Everest is the world's highest peak.
hi: एवरेस्ट पर्वत दुनिया का सबसे ऊँचा पर्वत शिखर है।

source: When will you return?
hi: तुम कब लौट कर आओगे?

source: He was sitting on a bench with his friend.
hi: वह अपने दोस्त के साथ बेंच पर बैठा है।

source: He has many history books.
hi: उसके पास बहुत सारी इतिहास की किताबें हैं।

source: I am thinking of changing jobs.
hi: मैं नौकरी बदलने की सोच रही हूँ।

source: I am thinking of changing my job.
hi: मैं नौकरी बदलने की सोच रही हूँ।

source: I'm thinking of changing jobs.
hi: मैं नौकरी बदलने की सोच रही हूँ।

source: You should be more careful of what you speak.
hi: तुम्हें अपने बोलने पर ज़्यादा ध्यान करना चहिए।
